tests/xml/200_create_payment.xml

<?xml version="1.0"?>
<APIResponse version="20150526">
    <Header>
        <Date>2015-12-17T16:57:38+01:00</Date>
        <Path>API/createPaymentRequest?terminal=Test+Terminal&amp;amount=9.95&amp;currency=EUR&amp;shop_orderid=1234567</Path>
        <ErrorCode>0</ErrorCode>
        <ErrorMessage/>
    </Header>
    <Body>
        <Result>Success</Result>
        <PaymentRequestId>eedaf3e1-2991-4898-b4b6-754cca0565a0</PaymentRequestId>
        <Url>https://testgateway.altapaysecure.com/eCommerce/API/requestForm?pid=eedaf3e1-2991-4898-b4b6-754cca0565a0</Url>
        <DynamicJavascriptUrl>https://testgateway.altapaysecure.com/eCommerce/API/embeddedPaymentWindow?pid=eedaf3e1-2991-4898-b4b6-754cca0565a0</DynamicJavascriptUrl>
    </Body>
</APIResponse>
